# 데이터프레임의 데이터 조작

In [58]:
import pandas as pd
import numpy as np

##데이터개수세기

In [2]:
s = pd.Series(range(10))
s[3]=np.nan
s

In [5]:
s.count()

9

In [7]:
df = pd.DataFrame(np.arange(16).reshape(4,4), dtype=float)
df.iloc[2,3] = np.nan
df

      0     1     2     3
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0   NaN
3  12.0  13.0  14.0  15.0

In [9]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [10]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [11]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [12]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [15]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

##카테고리값 세기

In [17]:
#남녀 성별 숫자세기
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [18]:
titanic.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

##정렬

In [19]:
np.random.seed(2021)

In [20]:
s2 = pd.Series(np.random.randint(10, size=100))
s2.tail()

95    9
96    6
97    9
98    3
99    9
dtype: int64

In [21]:
s2.value_counts()

9    15
6    13
5    12
7    11
3    11
1    10
4     9
2     9
0     7
8     3
dtype: int64

In [22]:
s2.value_counts().sort_values()

8     3
0     7
4     9
2     9
1    10
7    11
3    11
5    12
6    13
9    15
dtype: int64

In [59]:
#내림차순 
s2.value_counts.sort_values(ascending=False)

AttributeError: ignored

In [24]:
titanic.sort_values(by='fare').head()

     survived  pclass   sex   age  ...  deck  embark_town  alive alone
271         1       3  male  25.0  ...   NaN  Southampton    yes  True
597         0       3  male  49.0  ...   NaN  Southampton     no  True
302         0       3  male  19.0  ...   NaN  Southampton     no  True
633         0       1  male   NaN  ...   NaN  Southampton     no  True
277         0       2  male   NaN  ...   NaN  Southampton     no  True

[5 rows x 15 columns]

In [25]:
titanic.sort_values(by='fare', ascending=False).head()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
258         1       1  female  35.0  ...   NaN    Cherbourg    yes   True
737         1       1    male  35.0  ...     B    Cherbourg    yes   True
679         1       1    male  36.0  ...     B    Cherbourg    yes  False
88          1       1  female  23.0  ...     C  Southampton    yes  False
27          0       1    male  19.0  ...     C  Southampton     no  False

[5 rows x 15 columns]

In [26]:
titanic.sort_values(by=['fare','age']).head()

     survived  pclass   sex   age  ...  deck  embark_town  alive alone
302         0       3  male  19.0  ...   NaN  Southampton     no  True
271         1       3  male  25.0  ...   NaN  Southampton    yes  True
179         0       3  male  36.0  ...   NaN  Southampton     no  True
822         0       1  male  38.0  ...   NaN  Southampton     no  True
806         0       1  male  39.0  ...     A  Southampton     no  True

[5 rows x 15 columns]

#행/열 합계

In [29]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df

      0     1     2     3
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0   NaN
3  12.0  13.0  14.0  15.0

In [30]:
df2.sum()

0    19
1    21
2    20
3     5
4    18
5    19
6    16
7    19
dtype: int64

In [31]:
df2.sum(axis=1)

0    43
1    33
2    19
3    42
dtype: int64

In [32]:
df2['Rowsum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  Rowsum
0  4  5  9  0  6  5  8  6      43
1  6  6  6  1  5  7  1  1      33
2  5  2  0  3  1  0  2  6      19
3  4  8  5  1  6  7  5  6      42

연습문제 4.4.3

In [34]:
# 1. 승객의 평균나이
titanic.age.mean()

29.69911764705882

In [35]:
#2.여성승객의 평균나이
titanic[titanic.sex == 'female'].head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
8         1       3  female  27.0  ...   NaN  Southampton    yes  False
9         1       2  female  14.0  ...   NaN    Cherbourg    yes  False

[5 rows x 15 columns]

In [36]:
titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

In [37]:
np.round(titanic[titanic.sex == 'female'].age.mean(), 1)

27.9

In [39]:
# 1등실 여성승객 평균나이
np.round(titanic[titanic.pclass == 1][titanic.sex == 'female'].age.mean(), 1)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

34.6

##apply변환

In [40]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [41]:
df3.apply(lambda x : x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [42]:
df3.apply(lambda x : x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [43]:
titanic["성년"] = titanic.apply(lambda r: "성년" if r.age >=20 else "미성년", axis=1)
titanic.tail()

     survived  pclass     sex   age  sibsp  ...  deck  embark_town alive  alone   성년
886         0       2    male  27.0      0  ...   NaN  Southampton    no   True   성년
887         1       1  female  19.0      0  ...     B  Southampton   yes   True  미성년
888         0       3  female   NaN      1  ...   NaN  Southampton    no  False  미성년
889         1       1    male  26.0      0  ...     C    Cherbourg   yes   True   성년
890         0       3    male  32.0      0  ...   NaN   Queenstown    no   True   성년

[5 rows x 16 columns]

In [ ]:
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail()

#연습문제 4.4.4

In [44]:
titanic['category1'] = titanic.apply(lambda r : r.sex if r.age >= 20 else 'child', axis=1)

#filna method

In [47]:
#결측치
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

###연습문제 4.4.5

In [49]:
titanic.age.fillna(titanic.age.mean(), inplace=True)
titanic.tail()

     survived  pclass     sex        age  ...  alive  alone   성년 category1
886         0       2    male  27.000000  ...     no   True   성년      male
887         1       1  female  19.000000  ...    yes   True  미성년     child
888         0       3  female  29.699118  ...     no  False  미성년     child
889         1       1    male  26.000000  ...    yes   True   성년      male
890         0       3    male  32.000000  ...     no   True   성년      male

[5 rows x 17 columns]

##astype() method

In [61]:
df3.apply(pd.value_count).fillna(0.0).astype(int)

SyntaxError: ignored

##실수값을 카테고리 값으로 변환

In [52]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [53]:
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년','청년','중년','장년','노년']
cats = pd.cut(ages, bins, labels=labels)

In [54]:
cats

[NaN, '미성년', '미성년', '청년', '청년', ..., '장년', '미성년', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년' < '청년' < '중년' < '장년' < '노년']

In [55]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [56]:
np.random.seed(2021)
np.random.randint(1000)
cats = pd.qcut(data, 4, labels=['Q1','Q2','Q3','Q4'])
cast

NameError: ignored